HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*
 * FreeRTOS+TCP
 * Copyright (C) 2022 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * SPDX-License-Identifier: MIT
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

/*---------------------------------------------------------------------------*/

/* Standard includes. */
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/* FreeRTOS includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"

/* FreeRTOS+TCP includes. */
#include "FreeRTOS_IP.h"
#include "FreeRTOS_IP_Private.h"
#include "FreeRTOS_ARP.h"
#if ipconfigIS_ENABLED( ipconfigUSE_MDNS ) || ipconfigIS_ENABLED( ipconfigUSE_LLMNR )
    #include "FreeRTOS_DNS.h"
#endif
#if ipconfigIS_ENABLED( ipconfigUSE_IPv6 )
    #include "FreeRTOS_ND.h"
#endif
#include "FreeRTOS_Routing.h"
#if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )
    #include "FreeRTOS_Sockets.h"
#endif
#include "NetworkBufferManagement.h"
#include "NetworkInterface.h"
#include "phyHandling.h"

/* ST includes. */
#if defined( STM32F1 )
    #include "stm32f1xx_hal.h"
#elif defined( STM32F2 )
    #include "stm32f2xx_hal.h"
#elif defined( STM32F4 )
    #include "stm32f4xx_hal.h"
#elif defined( STM32F7 )
    #include "stm32f7xx_hal.h"
#elif defined( STM32H7 )
    #include "stm32h7xx_hal.h"
#elif defined( STM32H7RS )
    #include "stm32h7rsxx_hal.h"
#elif defined( STM32H5 )
    #include "stm32h5xx_hal.h"
#elif defined( STM32N6 )
    #include "stm32n6xx_hal.h"
#else /* if defined( STM32F4 ) */
    #error "Unknown STM32 Family for NetworkInterface"
#endif /* if defined( STM32F4 ) */

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                                Config                                     */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

#if defined( STM32F7 ) || defined( STM32F4 ) || defined( STM32F2 ) || defined( STM32F1 )
    #define niEMAC_STM32FX
#elif defined( STM32H7 ) || defined( STM32H7RS ) || defined( STM32H5 )
    #define niEMAC_STM32HX
#elif defined( STM32N6 )
    #define niEMAC_STM32NX
#endif

#if defined( niEMAC_STM32HX ) || defined( niEMAC_STM32NX )
    #define niEMAC_STM32HNX
#endif

#if defined( niEMAC_STM32NX )
    #define niEMAC_ETH_INSTANCE         ETH1
    #define niEMAC_ETH_IRQ_NUMBER       ETH1_IRQn
    #define niEMAC_ETH_IRQ_HANDLER      ETH1_IRQHandler
    #define niEMAC_DMA_CHANNEL_INDEX    ETH_DMA_CH0_IDX
    #define niEMAC_RX_CHANNEL_COUNT     ETH_DMA_RX_CH_CNT
    #define niEMAC_TX_CHANNEL_COUNT     ETH_DMA_TX_CH_CNT
    #define niEMAC_RX_DESC_LIST( pxHandle, ulChannel )    ( ( pxHandle )->RxDescList[ ( ulChannel ) ] )
    #define niEMAC_TX_DESC_LIST( pxHandle, ulChannel )    ( ( pxHandle )->TxDescList[ ( ulChannel ) ] )
#else
    #define niEMAC_ETH_INSTANCE        ETH
    #define niEMAC_ETH_IRQ_NUMBER      ETH_IRQn
    #define niEMAC_ETH_IRQ_HANDLER     ETH_IRQHandler
    #define niEMAC_DMA_CHANNEL_INDEX   0U
    #define niEMAC_RX_CHANNEL_COUNT    1U
    #define niEMAC_TX_CHANNEL_COUNT    1U
    #define niEMAC_RX_DESC_LIST( pxHandle, ulChannel )    ( ( pxHandle )->RxDescList )
    #define niEMAC_TX_DESC_LIST( pxHandle, ulChannel )    ( ( pxHandle )->TxDescList )
#endif /* if defined( niEMAC_STM32NX ) */

#if defined( niEMAC_STM32FX )
    #define niEMAC_ETH_CLOCKS_ENABLED()    ( __HAL_RCC_ETH_IS_CLK_ENABLED() != 0 )
#elif defined( STM32H5 )
    #define niEMAC_ETH_CLOCKS_ENABLED()            \
    ( ( __HAL_RCC_ETH_IS_CLK_ENABLED() != 0 ) &&   \
      ( __HAL_RCC_ETHTX_IS_CLK_ENABLED() != 0 ) && \
      ( __HAL_RCC_ETHRX_IS_CLK_ENABLED() != 0 ) )
#elif defined( STM32H7 ) || defined( STM32H7RS )
    #define niEMAC_ETH_CLOCKS_ENABLED()              \
    ( ( __HAL_RCC_ETH1MAC_IS_CLK_ENABLED() != 0 ) && \
      ( __HAL_RCC_ETH1TX_IS_CLK_ENABLED() != 0 ) &&  \
      ( __HAL_RCC_ETH1RX_IS_CLK_ENABLED() != 0 ) )
#elif defined( niEMAC_STM32NX )
    #define niEMAC_ETH_CLOCKS_ENABLED()              \
    ( ( __HAL_RCC_ETH1_IS_CLK_ENABLED() != 0 ) &&    \
      ( __HAL_RCC_ETH1MAC_IS_CLK_ENABLED() != 0 ) && \
      ( __HAL_RCC_ETH1TX_IS_CLK_ENABLED() != 0 ) &&  \
      ( __HAL_RCC_ETH1RX_IS_CLK_ENABLED() != 0 ) )
#endif /* if defined( niEMAC_STM32FX ) */

#define niEMAC_TASK_NAME                  "EMAC_STM32"
#define niEMAC_TASK_PRIORITY              ( configMAX_PRIORITIES - 1 )
#define niEMAC_TASK_STACK_SIZE            ( 4U * configMINIMAL_STACK_SIZE )

#define niEMAC_TX_DESC_SECTION            ".TxDescripSection"
#define niEMAC_RX_DESC_SECTION            ".RxDescripSection"
#define niEMAC_BUFFERS_SECTION            ".EthBuffersSection"

#define niEMAC_TASK_MAX_BLOCK_TIME_MS     100U
#define niEMAC_TX_MAX_BLOCK_TIME_MS       20U
#define niEMAC_RX_MAX_BLOCK_TIME_MS       20U
#define niEMAC_DESCRIPTOR_WAIT_TIME_MS    20U

#define niEMAC_TX_MUTEX_NAME              "EMAC_TxMutex"
#define niEMAC_TX_DESC_SEM_NAME           "EMAC_TxDescSem"

