HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
    #undef ETH_IP_PAYLOAD_IGMP
    #define ETH_IP_PAYLOAD_IGMP                      0x4U

#elif defined( niEMAC_STM32NX )

    #define niEMAC_DMA_TX_BUFFER_UNAVAILABLE_FLAG    ETH_DMACxSR_TBU
    #define niEMAC_DMA_ERROR_MASK                    ( HAL_ETH_ERROR_DMA_CH0 | HAL_ETH_ERROR_DMA_CH1 )
    #define niEMAC_MAC_ADDRESS_ENABLE_FLAG           ETH_MACAxHR_AE

    #undef ETH_IP_PAYLOAD_IGMP
    #define ETH_IP_PAYLOAD_IGMP                      0x4U

#endif /* family-specific compatibility definitions */

#define ETH_IP_PAYLOAD_MASK           0x7U

/* IEEE 802.3 CRC32 polynomial - 0x04C11DB7 */
#define niEMAC_CRC_POLY               0x04C11DB7
#define niEMAC_MAC_IS_MULTICAST( MAC )    ( ( MAC[ 0 ] & 1U ) != 0 )
#define niEMAC_MAC_IS_UNICAST( MAC )      ( ( MAC[ 0 ] & 1U ) == 0 )
#define niEMAC_ADDRESS_HASH_BITS      64U
#define niEMAC_MAC_SRC_MATCH_COUNT    3U

#if defined( niEMAC_STM32FX )
    /* F-series HAL expects [ high, low ]; newer HALs expect [ low, high ]. */
    #define niEMAC_HASH_TABLE_LOW_WORD_INDEX     1U
    #define niEMAC_HASH_TABLE_HIGH_WORD_INDEX    0U
#else
    #define niEMAC_HASH_TABLE_LOW_WORD_INDEX     0U
    #define niEMAC_HASH_TABLE_HIGH_WORD_INDEX    1U
#endif

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                               typedefs                                    */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

/* Interrupt events to process: reception, transmission and error handling. */
typedef enum
{
    eMacEventNone = 0,
    eMacEventRx = 1 << 0,
    eMacEventTx = 1 << 1,
    eMacEventErrRx = 1 << 2,
    eMacEventErrTx = 1 << 3,
    eMacEventErrDma = 1 << 4,
    eMacEventErrEth = 1 << 5,
    eMacEventErrMac = 1 << 6,
    eMacEventAll = ( 1 << 7 ) - 1,
} eMAC_IF_EVENT;

typedef enum
{
    eMacEthInit,     /* Must initialise ETH. */
    eMacPhyInit,     /* Must initialise PHY. */
    eMacPhyStart,    /* Must start PHY. */
    eMacTaskStart,   /* Must start deferred interrupt handler task. */
    eMacEthStart,    /* Must start ETH. */
    eMacInitComplete /* Initialisation was successful. */
} eMAC_INIT_STATUS_TYPE;

/* typedef struct xMacSrcMatchData
 * {
 *  uint8_t ucSrcMatchCounters[ niEMAC_MAC_SRC_MATCH_COUNT ];
 *  uint8_t uxMACEntryIndex = 0;
 * } MacSrcMatchData_t;
 *
 * typedef struct xMacHashData
 * {
 *  uint32_t ulHashTable[ niEMAC_ADDRESS_HASH_BITS / 32 ];
 *  uint8_t ucAddrHashCounters[ niEMAC_ADDRESS_HASH_BITS ];
 * } MacHashData_t;
 *
 * typedef struct xMacFilteringData
 * {
 *  MacSrcMatchData_t xSrcMatch;
 *  MacHashData_t xHash;
 * } MacFilteringData_t;
 *
 * typedef struct xEMACData
 * {
 *  ETH_HandleTypeDef xEthHandle;
 *  EthernetPhy_t xPhyObject;
 *  TaskHandle_t xEMACTaskHandle;
 *  SemaphoreHandle_t xTxMutex, xTxDescSem;
 *  ETH_BufferTypeDef xTxBuffers[ niEMAC_BUFS_PER_DESC * ETH_TX_DESC_CNT ];
 *  BaseType_t xSwitchRequired;
 *  eMAC_INIT_STATUS_TYPE xMacInitStatus;
 *  BaseType_t xEMACIndex;
 *  MacFilteringData_t xMacFilteringData;
 * } EMACData_t; */

/* TODO: need a data structure to assist in adding/removing allowed addresses */

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                      Static Function Declarations                         */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

/* PHY Management */
static BaseType_t prvPhyReadReg( BaseType_t xAddress,
                                 BaseType_t xRegister,
                                 uint32_t * pulValue );
static BaseType_t prvPhyWriteReg( BaseType_t xAddress,
                                  BaseType_t xRegister,
                                  uint32_t ulValue );

static void prvForceRefreshPhyLinkStatus( EthernetPhy_t * pxPhyObject );
static BaseType_t prvPhyInit( EthernetPhy_t * pxPhyObject );
static BaseType_t prvPhyStart( ETH_HandleTypeDef * pxEthHandle,
                               NetworkInterface_t * pxInterface,
                               EthernetPhy_t * pxPhyObject );

/* Network Interface Access Hooks */
static BaseType_t prvGetPhyLinkStatus( NetworkInterface_t * pxInterface );
static BaseType_t prvNetworkInterfaceInitialise( NetworkInterface_t * pxInterface );
static BaseType_t prvNetworkInterfaceOutput( NetworkInterface_t * pxInterface,
                                             NetworkBufferDescriptor_t * const pxDescriptor,
                                             BaseType_t xReleaseAfterSend );
static void prvAddAllowedMACAddress( NetworkInterface_t * pxInterface,
                                     const uint8_t * pucMacAddress );
static void prvRemoveAllowedMACAddress( NetworkInterface_t * pxInterface,
                                        const uint8_t * pucMacAddress );

/* EMAC Task */
static BaseType_t prvNetworkInterfaceInput( ETH_HandleTypeDef * pxEthHandle,
                                            NetworkInterface_t * pxInterface );
static __NO_RETURN portTASK_FUNCTION_PROTO( prvEMACHandlerTask,
                                            pvParameters );
static BaseType_t prvEMACTaskStart( NetworkInterface_t * pxInterface );

/* EMAC Recovery */
static BaseType_t prvRecoverFromCriticalError( ETH_HandleTypeDef * pxEthHandle,
                                               EthernetPhy_t * pxPhyObject,
                                               NetworkInterface_t * pxInterface );

/* EMAC Init */
static BaseType_t prvApplyMACDMAConfig( ETH_HandleTypeDef * pxEthHandle,
                                        const EthernetPhy_t * pxPhyObject );
static BaseType_t prvMacUpdateConfig( ETH_HandleTypeDef * pxEthHandle,
                                      EthernetPhy_t * pxPhyObject );
static BaseType_t prvEthConfigInit( ETH_HandleTypeDef * pxEthHandle,
                                    NetworkInterface_t * pxInterface );

/* MAC and Packet Filtering */
static BaseType_t prvConfigureMACAddressFilter( ETH_HandleTypeDef * pxEthHandle );
static BaseType_t prvInitMacAddresses( ETH_HandleTypeDef * pxEthHandle,
                                      NetworkInterface_t * pxInterface );
static BaseType_t prvRestoreMACAddressFilters( ETH_HandleTypeDef * pxEthHandle );
#ifdef niEMAC_STM32HNX
    static void prvInitPacketFilter( ETH_HandleTypeDef * pxEthHandle,
                                     const NetworkInterface_t * const pxInterface );
#endif
static uint32_t prvCalcCrc32( const uint8_t * const pucMACAddr );
static uint8_t prvGetMacHashIndex( const uint8_t * const pucMACAddr );
static void prvHAL_ETH_SetDestMACAddrMatch( ETH_TypeDef * const pxEthInstance,
                                            uint8_t ucIndex,
                                            const uint8_t * const pucMACAddr );
static void prvHAL_ETH_ClearDestMACAddrMatch( ETH_TypeDef * const pxEthInstance,
                                              uint8_t ucIndex );
static BaseType_t prvAddDestMACAddrMatch( ETH_TypeDef * const pxEthInstance,
                                          const uint8_t * const pucMACAddr );
static BaseType_t prvRemoveDestMACAddrMatch( ETH_TypeDef * const pxEthInstance,
                                             const uint8_t * const pucMACAddr );
static BaseType_t prvSetNewDestMACAddrMatch( ETH_TypeDef * const pxEthInstance,
                                             uint8_t ucHashIndex,
                                             const uint8_t * const pucMACAddr );
static void prvAddDestMACAddrHash( ETH_HandleTypeDef * pxEthHandle,
                                   uint8_t ucHashIndex );
static void prvRemoveDestMACAddrHash( ETH_HandleTypeDef * pxEthHandle,
                                      const uint8_t * const pucMACAddr );
static void prvResetMACAddressFilters( ETH_HandleTypeDef * pxEthHandle );

/* EMAC Helpers */
static void prvReleaseTxPacket( ETH_HandleTypeDef * pxEthHandle );
static void prvReleaseNetworkBufferDescriptor( NetworkBufferDescriptor_t * const pxDescriptor );
static void prvSendRxEvent( NetworkBufferDescriptor_t * const pxDescriptor );
static BaseType_t prvAcceptPacket( ETH_HandleTypeDef * pxEthHandle,
                                   NetworkInterface_t * pxInterface,
                                   NetworkBufferDescriptor_t * pxDescriptor );
#if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )
    static BaseType_t prvPassesPacketFilter( const NetworkBufferDescriptor_t * const pxDescriptor );
#endif

/* Cache Maintenance Helpers */
#ifdef niEMAC_CACHEABLE
    static uintptr_t prvGetCacheAlignedRange( const void * pvAddress,
                                              size_t uxLength,
                                              size_t * puxAlignedLength );
    static void prvCacheCleanByAddr( const void * pvAddress,
                                     size_t uxLength );
    static void prvCacheCleanInvalidateByAddr( const void * pvAddress,
                                               size_t uxLength );
    static void prvCacheInvalidateByAddr( const void * pvAddress,
                                          size_t uxLength );
#endif

/* Network Interface Definition */
NetworkInterface_t * pxSTM32_FillInterfaceDescriptor( BaseType_t xEMACIndex,
                                                      NetworkInterface_t * pxInterface );

