HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                      Static Variable Declarations                         */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

/* static EMACData_t xEMACData; */

static ETH_HandleTypeDef xEthHandle;

static EthernetPhy_t xPhyObject;

static TaskHandle_t xEMACTaskHandle = NULL;
static SemaphoreHandle_t xTxMutex = NULL, xTxDescSem = NULL;

static volatile BaseType_t xSwitchRequired = pdFALSE;
static volatile BaseType_t xDropCurrentRxFrame = pdFALSE;

static eMAC_INIT_STATUS_TYPE xMacInitStatus = eMacEthInit;

/* Src Mac Matching */
static uint8_t ucSrcMatchCounters[ niEMAC_MAC_SRC_MATCH_COUNT ] = { 0U };
static uint8_t ucSrcMatchAddresses[ niEMAC_MAC_SRC_MATCH_COUNT ][ ipMAC_ADDRESS_LENGTH_BYTES ] = { 0U };
/* Src Mac Hashing */
static uint32_t ulHashTable[ niEMAC_ADDRESS_HASH_BITS / 32 ];
static uint8_t ucAddrHashCounters[ niEMAC_ADDRESS_HASH_BITS ] = { 0U };

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                         Cache Maintenance Helpers                         */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

#ifdef niEMAC_CACHEABLE

    static uintptr_t prvGetCacheAlignedRange( const void * pvAddress,
                                              size_t uxLength,
                                              size_t * puxAlignedLength )
    {
        const uintptr_t uxAddress = ( uintptr_t ) pvAddress;
        const uintptr_t uxLineStart = uxAddress & ~( ( uintptr_t ) niEMAC_DATA_ALIGNMENT_MASK );
        const uintptr_t uxLineEnd = ( uxAddress + uxLength + niEMAC_DATA_ALIGNMENT_MASK ) & ~( ( uintptr_t ) niEMAC_DATA_ALIGNMENT_MASK );

        *puxAlignedLength = uxLineEnd - uxLineStart;

        return uxLineStart;
    }

/*---------------------------------------------------------------------------*/

    static void prvCacheCleanByAddr( const void * pvAddress,
                                     size_t uxLength )
    {
        if( ( pvAddress != NULL ) && ( uxLength > 0U ) )
        {
            size_t uxAlignedLength;
            const uintptr_t uxLineStart = prvGetCacheAlignedRange( pvAddress, uxLength, &uxAlignedLength );
            SCB_CleanDCache_by_Addr( ( uint32_t * ) uxLineStart, ( int32_t ) uxAlignedLength );
        }
    }

/*---------------------------------------------------------------------------*/

    static void prvCacheCleanInvalidateByAddr( const void * pvAddress,
                                               size_t uxLength )
    {
        if( ( pvAddress != NULL ) && ( uxLength > 0U ) )
        {
            size_t uxAlignedLength;
            const uintptr_t uxLineStart = prvGetCacheAlignedRange( pvAddress, uxLength, &uxAlignedLength );
            SCB_CleanInvalidateDCache_by_Addr( ( uint32_t * ) uxLineStart, ( int32_t ) uxAlignedLength );
        }
    }

/*---------------------------------------------------------------------------*/

    static void prvCacheInvalidateByAddr( const void * pvAddress,
                                          size_t uxLength )
    {
        if( ( pvAddress != NULL ) && ( uxLength > 0U ) )
        {
            size_t uxAlignedLength;
            const uintptr_t uxLineStart = prvGetCacheAlignedRange( pvAddress, uxLength, &uxAlignedLength );
            SCB_InvalidateDCache_by_Addr( ( uint32_t * ) uxLineStart, ( int32_t ) uxAlignedLength );
        }
    }

#endif /* ifdef niEMAC_CACHEABLE */

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                              PHY Management                              */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static BaseType_t prvPhyReadReg( BaseType_t xAddress,
                                 BaseType_t xRegister,
                                 uint32_t * pulValue )
{
    BaseType_t xResult = 0;

    if( HAL_ETH_ReadPHYRegister( &xEthHandle, ( uint32_t ) xAddress, ( uint32_t ) xRegister, pulValue ) != HAL_OK )
    {
        xResult = -1;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvPhyWriteReg( BaseType_t xAddress,
                                  BaseType_t xRegister,
                                  uint32_t ulValue )
{
    BaseType_t xResult = 0;

    if( HAL_ETH_WritePHYRegister( &xEthHandle, ( uint32_t ) xAddress, ( uint32_t ) xRegister, ulValue ) != HAL_OK )
    {
        xResult = -1;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static void prvForceRefreshPhyLinkStatus( EthernetPhy_t * pxPhyObject )
{
    vTaskSetTimeOutState( &( pxPhyObject->xLinkStatusTimer ) );
    pxPhyObject->xLinkStatusRemaining = 0U;
    ( void ) xPhyCheckLinkStatus( pxPhyObject, pdFALSE );
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvPhyInit( EthernetPhy_t * pxPhyObject )
{
    BaseType_t xResult = pdFAIL;

    vPhyInitialise( pxPhyObject, ( xApplicationPhyReadHook_t ) prvPhyReadReg, ( xApplicationPhyWriteHook_t ) prvPhyWriteReg );

    if( xPhyDiscover( pxPhyObject ) != 0 )
    {
        xResult = pdPASS;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvPhyStart( ETH_HandleTypeDef * pxEthHandle,
                               NetworkInterface_t * pxInterface,
                               EthernetPhy_t * pxPhyObject )
{
    BaseType_t xResult = pdFALSE;

