HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
        if( xRecoveryRequired != pdFALSE )
        {
            if( prvRecoverFromCriticalError( pxEthHandle, pxPhyObject, pxInterface ) != pdFALSE )
            {
                if( prvGetPhyLinkStatus( pxInterface ) == pdFALSE )
                {
                    xRecoveryRequired = pdFALSE;
                }
                else if( HAL_ETH_Start_IT( pxEthHandle ) == HAL_OK )
                {
                    xRecoveryRequired = pdFALSE;
                    xResult = prvNetworkInterfaceInput( pxEthHandle, pxInterface );
                }
                else
                {
                    FreeRTOS_debug_printf( ( "prvEMACHandlerTask: HAL_ETH_Start_IT failed after recovery\n" ) );
                }
            }
        }

        const BaseType_t xLinkStatusChanged = xPhyCheckLinkStatus( pxPhyObject, xResult );

        if( prvGetPhyLinkStatus( pxInterface ) != pdFALSE )
        {
            if( ( xRecoveryRequired == pdFALSE ) &&
                ( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_READY ) )
            {
                /* Link was down, or a previous start attempt failed. */
                if( prvMacUpdateConfig( pxEthHandle, pxPhyObject ) != pdFALSE )
                {
                    if( HAL_ETH_Start_IT( pxEthHandle ) != HAL_OK )
                    {
                        FreeRTOS_debug_printf( ( "prvEMACHandlerTask: HAL_ETH_Start_IT failed on link-up\n" ) );
                    }
                }
            }
        }
        else
        {
            BaseType_t xMACStopped = pdFALSE;

            if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_STARTED )
            {
                if( HAL_ETH_Stop_IT( pxEthHandle ) != HAL_OK )
                {
                    FreeRTOS_debug_printf( ( "prvEMACHandlerTask: HAL_ETH_Stop_IT failed on link-down\n" ) );
                }
                else
                {
                    xMACStopped = pdTRUE;
                }
            }

            if( ( xMACStopped != pdFALSE ) || ( xLinkStatusChanged != pdFALSE ) )
            {
                prvReleaseTxPacket( pxEthHandle );
            }

            if( xLinkStatusChanged != pdFALSE )
            {
                #if ( ipconfigIS_ENABLED( ipconfigSUPPORT_NETWORK_DOWN_EVENT ) )
                    FreeRTOS_NetworkDown( pxInterface );
                #endif
            }
        }
    }
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvEMACTaskStart( NetworkInterface_t * pxInterface )
{
    BaseType_t xResult = pdFALSE;

    if( xTxMutex == NULL )
    {
        #if ipconfigIS_ENABLED( configSUPPORT_STATIC_ALLOCATION )
            static StaticSemaphore_t xTxMutexBuf;
            xTxMutex = xSemaphoreCreateMutexStatic( &xTxMutexBuf );
        #else
            xTxMutex = xSemaphoreCreateMutex();
        #endif
        configASSERT( xTxMutex != NULL );
        #if ( configQUEUE_REGISTRY_SIZE > 0 )
            vQueueAddToRegistry( xTxMutex, niEMAC_TX_MUTEX_NAME );
        #endif
    }

    if( xTxDescSem == NULL )
    {
        #if ( ipconfigIS_ENABLED( configSUPPORT_STATIC_ALLOCATION ) )
            static StaticSemaphore_t xTxDescSemBuf;
            xTxDescSem = xSemaphoreCreateCountingStatic(
                ( UBaseType_t ) ETH_TX_DESC_CNT,
                ( UBaseType_t ) ETH_TX_DESC_CNT,
                &xTxDescSemBuf
                );
        #else
            xTxDescSem = xSemaphoreCreateCounting(
                ( UBaseType_t ) ETH_TX_DESC_CNT,
                ( UBaseType_t ) ETH_TX_DESC_CNT
                );
        #endif /* if ( ipconfigIS_ENABLED( configSUPPORT_STATIC_ALLOCATION ) ) */
        configASSERT( xTxDescSem != NULL );
        #if ( configQUEUE_REGISTRY_SIZE > 0 )
            vQueueAddToRegistry( xTxDescSem, niEMAC_TX_DESC_SEM_NAME );
        #endif
    }

    if( ( xEMACTaskHandle == NULL ) && ( xTxMutex != NULL ) && ( xTxDescSem != NULL ) )
    {
        #if ipconfigIS_ENABLED( configSUPPORT_STATIC_ALLOCATION )
            static StackType_t uxEMACTaskStack[ niEMAC_TASK_STACK_SIZE ];
            static StaticTask_t xEMACTaskTCB;
            xEMACTaskHandle = xTaskCreateStatic(
                prvEMACHandlerTask,
                niEMAC_TASK_NAME,
                niEMAC_TASK_STACK_SIZE,
                ( void * ) pxInterface,
                niEMAC_TASK_PRIORITY,
                uxEMACTaskStack,
                &xEMACTaskTCB
                );
        #else /* if ipconfigIS_ENABLED( configSUPPORT_STATIC_ALLOCATION ) */
            ( void ) xTaskCreate(
                prvEMACHandlerTask,
                niEMAC_TASK_NAME,
                niEMAC_TASK_STACK_SIZE,
                ( void * ) pxInterface,
                niEMAC_TASK_PRIORITY,
                &xEMACTaskHandle
                );
        #endif /* if ipconfigIS_ENABLED( configSUPPORT_STATIC_ALLOCATION ) */
    }

    if( xEMACTaskHandle != NULL )
    {
        xResult = pdTRUE;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                               EMAC Recovery                               */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static BaseType_t prvRecoverFromCriticalError( ETH_HandleTypeDef * pxEthHandle,
                                               EthernetPhy_t * pxPhyObject,
                                               NetworkInterface_t * pxInterface )
{
    BaseType_t xResult = pdFALSE;
    NetworkBufferDescriptor_t * pxTxPackets[ ETH_TX_DESC_CNT ] = { NULL };
    NetworkBufferDescriptor_t * pxPartialRxPackets[ niEMAC_RX_CHANNEL_COUNT ] = { NULL };
    uint8_t * pucRxBuffers[ niEMAC_RX_CHANNEL_COUNT ][ ETH_RX_DESC_CNT ] = { { NULL } };

    if( ( xTxMutex == NULL ) || ( xTxDescSem == NULL ) ||
        ( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( niEMAC_TX_MAX_BLOCK_TIME_MS ) ) == pdFALSE ) )
    {
        FreeRTOS_debug_printf( ( "prvRecoverFromCriticalError: Failed to take TX mutex\n" ) );
        return pdFALSE;
    }

