HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
    xDropCurrentRxFrame = pdFALSE;

    ETH_TxDescListTypeDef * const pxTxDescList = &( niEMAC_TX_DESC_LIST( pxEthHandle, niEMAC_DMA_CHANNEL_INDEX ) );

    #if defined( niEMAC_STM32NX )
        pxEthHandle->TxOpCH = niEMAC_DMA_CHANNEL_INDEX;
    #endif
    const uint32_t ulTxBuffersInUse = HAL_ETH_GetTxBuffersNumber( pxEthHandle );

    for( UBaseType_t uxIndex = 0U; uxIndex < ( UBaseType_t ) ETH_TX_DESC_CNT; uxIndex++ )
    {
        pxTxPackets[ uxIndex ] = ( NetworkBufferDescriptor_t * ) pxTxDescList->PacketAddress[ uxIndex ];
    }

    for( uint32_t ulChannel = 0U; ulChannel < niEMAC_RX_CHANNEL_COUNT; ulChannel++ )
    {
        ETH_RxDescListTypeDef * const pxRxDescList = &( niEMAC_RX_DESC_LIST( pxEthHandle, ulChannel ) );

        pxPartialRxPackets[ ulChannel ] = ( NetworkBufferDescriptor_t * ) pxRxDescList->pRxStart;

        for( UBaseType_t uxIndex = 0U; uxIndex < ( UBaseType_t ) ETH_RX_DESC_CNT; uxIndex++ )
        {
            ETH_DMADescTypeDef * const pxRxDesc = ( ETH_DMADescTypeDef * ) ( uintptr_t ) pxRxDescList->RxDesc[ uxIndex ];

            if( pxRxDesc != NULL )
            {
                pucRxBuffers[ ulChannel ][ uxIndex ] = ( uint8_t * ) ( uintptr_t ) pxRxDesc->BackupAddr0;
            }
        }
    }

    if( HAL_ETH_Init( pxEthHandle ) != HAL_OK )
    {
        FreeRTOS_debug_printf( ( "prvRecoverFromCriticalError: HAL_ETH_Init failed\n" ) );
    }
    else
    {
        UBaseType_t uxPacketsReleased = 0U;

        #if defined( niEMAC_STM32FX )
            /* F-series HAL_ETH_Init() does not restore the MDIO clock divider. */
            HAL_ETH_SetMDIOClockRange( pxEthHandle );
        #endif

        /* HAL reinitialisation has stopped DMA and reset the descriptors, so
         * their zero-copy buffers can now be safely returned. */
        for( UBaseType_t uxIndex = 0U; uxIndex < ( UBaseType_t ) ETH_TX_DESC_CNT; uxIndex++ )
        {
            pxTxDescList->PacketAddress[ uxIndex ] = NULL;

            if( pxTxPackets[ uxIndex ] != NULL )
            {
                prvReleaseNetworkBufferDescriptor( pxTxPackets[ uxIndex ] );
                uxPacketsReleased++;
            }
        }

        if( uxPacketsReleased != ( UBaseType_t ) ulTxBuffersInUse )
        {
            FreeRTOS_debug_printf( ( "prvRecoverFromCriticalError: TX buffer bookkeeping mismatch\n" ) );
            configASSERT( uxPacketsReleased == ( UBaseType_t ) ulTxBuffersInUse );
        }

        pxTxDescList->BuffersInUse = 0U;
        pxTxDescList->releaseIndex = 0U;
        pxTxDescList->CurrentPacketAddress = NULL;

        for( uint32_t ulIndex = 0U; ulIndex < ulTxBuffersInUse; ulIndex++ )
        {
            const BaseType_t xGiveResult = xSemaphoreGive( xTxDescSem );

            configASSERT( xGiveResult == pdTRUE );

            if( xGiveResult == pdFALSE )
            {
                break;
            }
        }

        for( uint32_t ulChannel = 0U; ulChannel < niEMAC_RX_CHANNEL_COUNT; ulChannel++ )
        {
            ETH_RxDescListTypeDef * const pxRxDescList = &( niEMAC_RX_DESC_LIST( pxEthHandle, ulChannel ) );

            pxRxDescList->pRxStart = NULL;
            pxRxDescList->pRxEnd = NULL;
            pxRxDescList->RxDataLength = 0U;
            pxRxDescList->pRxLastRxDesc = 0U;

            prvReleaseNetworkBufferDescriptor( pxPartialRxPackets[ ulChannel ] );

            for( UBaseType_t uxIndex = 0U; uxIndex < ( UBaseType_t ) ETH_RX_DESC_CNT; uxIndex++ )
            {
                if( pucRxBuffers[ ulChannel ][ uxIndex ] != NULL )
                {
                    NetworkBufferDescriptor_t * const pxDescriptor = pxPacketBuffer_to_NetworkBuffer( ( const void * ) pucRxBuffers[ ulChannel ][ uxIndex ] );

                    configASSERT( pxDescriptor != NULL );

                    if( pxDescriptor != NULL )
                    {
                        prvReleaseNetworkBufferDescriptor( pxDescriptor );
                    }
                }
            }
        }

        if( prvApplyMACDMAConfig( pxEthHandle, pxPhyObject ) == pdFALSE )
        {
            FreeRTOS_debug_printf( ( "prvRecoverFromCriticalError: Failed to restore MAC/DMA configuration\n" ) );
        }
        else
        {
            #if defined( niEMAC_STM32HNX )
                prvInitPacketFilter( pxEthHandle, pxInterface );
            #endif

            xResult = prvRestoreMACAddressFilters( pxEthHandle );
        }
    }

    ( void ) xSemaphoreGive( xTxMutex );

    return xResult;
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                                 EMAC Init                                 */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static BaseType_t prvApplyMACDMAConfig( ETH_HandleTypeDef * pxEthHandle,
                                        const EthernetPhy_t * pxPhyObject )
{
    ETH_MACConfigTypeDef xMACConfig = { 0 };

    if( HAL_ETH_GetMACConfig( pxEthHandle, &xMACConfig ) != HAL_OK )
    {
        FreeRTOS_debug_printf( ( "prvApplyMACDMAConfig: HAL_ETH_GetMACConfig failed\n" ) );
        return pdFALSE;
    }

    if( pxPhyObject != NULL )
    {
        xMACConfig.DuplexMode = ( pxPhyObject->xPhyProperties.ucDuplex == PHY_DUPLEX_FULL ) ? ETH_FULLDUPLEX_MODE : ETH_HALFDUPLEX_MODE;
        xMACConfig.Speed = ( pxPhyObject->xPhyProperties.ucSpeed == PHY_SPEED_10 ) ? ETH_SPEED_10M : ETH_SPEED_100M;
    }

    xMACConfig.ChecksumOffload = ( FunctionalState ) ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM );
    xMACConfig.CRCStripTypePacket = DISABLE;
    xMACConfig.AutomaticPadCRCStrip = ENABLE;
    xMACConfig.RetryTransmission = ENABLE;

    if( HAL_ETH_SetMACConfig( pxEthHandle, &xMACConfig ) != HAL_OK )
    {
        FreeRTOS_debug_printf( ( "prvApplyMACDMAConfig: HAL_ETH_SetMACConfig failed\n" ) );
        return pdFALSE;
    }

    ETH_DMAConfigTypeDef xDMAConfig = { 0 };

    if( HAL_ETH_GetDMAConfig( pxEthHandle, &xDMAConfig ) != HAL_OK )
    {
        FreeRTOS_debug_printf( ( "prvApplyMACDMAConfig: HAL_ETH_GetDMAConfig failed\n" ) );
        return pdFALSE;
    }

