HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
    #if defined( niEMAC_STM32FX )
        xDMAConfig.EnhancedDescriptorFormat = ( FunctionalState ) ( ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM ) || ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM ) );
    #elif defined( niEMAC_STM32HX )
        xDMAConfig.SecondPacketOperate = ENABLE;
    #elif defined( niEMAC_STM32NX )
        for( uint32_t ulChannel = 0; ulChannel < ETH_DMA_CH_CNT; ulChannel++ )
        {
            xDMAConfig.DMACh[ ulChannel ].SecondPacketOperate = ENABLE;
        }
    #endif /* if defined( niEMAC_STM32FX ) */

    if( HAL_ETH_SetDMAConfig( pxEthHandle, &xDMAConfig ) != HAL_OK )
    {
        FreeRTOS_debug_printf( ( "prvApplyMACDMAConfig: HAL_ETH_SetDMAConfig failed\n" ) );
        return pdFALSE;
    }

    return pdTRUE;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvMacUpdateConfig( ETH_HandleTypeDef * pxEthHandle,
                                      EthernetPhy_t * pxPhyObject )
{
    BaseType_t xResult = pdFALSE;

    if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_STARTED )
    {
        if( HAL_ETH_Stop_IT( pxEthHandle ) != HAL_OK )
        {
            FreeRTOS_debug_printf( ( "prvMacUpdateConfig: HAL_ETH_Stop_IT failed\n" ) );
            return pdFALSE;
        }
    }

    #if ipconfigIS_ENABLED( niEMAC_AUTO_NEGOTIATION )
        ( void ) xPhyStartAutoNegotiation( pxPhyObject, xPhyGetMask( pxPhyObject ) );
    #else
        ( void ) xPhyFixedValue( pxPhyObject, xPhyGetMask( pxPhyObject ) );
    #endif

    if( prvApplyMACDMAConfig( pxEthHandle, pxPhyObject ) != pdFALSE )
    {
        xResult = pdTRUE;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvEthConfigInit( ETH_HandleTypeDef * pxEthHandle,
                                    NetworkInterface_t * pxInterface )
{
    BaseType_t xResult = pdFALSE;

    pxEthHandle->Instance = niEMAC_ETH_INSTANCE;
    pxEthHandle->Init.MediaInterface = ipconfigIS_ENABLED( niEMAC_USE_RMII ) ? HAL_ETH_RMII_MODE : HAL_ETH_MII_MODE;
    pxEthHandle->Init.RxBuffLen = niEMAC_DATA_BUFFER_SIZE;

    /* RxBuffLen includes alignment padding, so compare the unpadded frame size
     * against the Ethernet maximum. */
    configASSERT( ipTOTAL_ETHERNET_FRAME_SIZE <= ETH_MAX_PACKET_SIZE );
    configASSERT( pxEthHandle->Init.RxBuffLen >= ipTOTAL_ETHERNET_FRAME_SIZE );
    configASSERT( pxEthHandle->Init.RxBuffLen % 4U == 0 );
    #if defined( niEMAC_STM32NX )
        static ETH_DMADescTypeDef xDMADescTx[ ETH_DMA_TX_CH_CNT ][ ETH_TX_DESC_CNT ] __ALIGNED( niEMAC_DATA_ALIGNMENT ) __attribute__( ( section( niEMAC_TX_DESC_SECTION ) ) );
        static ETH_DMADescTypeDef xDMADescRx[ ETH_DMA_RX_CH_CNT ][ ETH_RX_DESC_CNT ] __ALIGNED( niEMAC_DATA_ALIGNMENT ) __attribute__( ( section( niEMAC_RX_DESC_SECTION ) ) );

        for( uint32_t ulChannel = 0; ulChannel < ETH_DMA_TX_CH_CNT; ulChannel++ )
        {
            configASSERT( ( ( uintptr_t ) xDMADescTx[ ulChannel ] & niEMAC_DATA_ALIGNMENT_MASK ) == 0U );
            pxEthHandle->Init.TxDesc[ ulChannel ] = xDMADescTx[ ulChannel ];
        }

        for( uint32_t ulChannel = 0; ulChannel < ETH_DMA_RX_CH_CNT; ulChannel++ )
        {
            configASSERT( ( ( uintptr_t ) xDMADescRx[ ulChannel ] & niEMAC_DATA_ALIGNMENT_MASK ) == 0U );
            pxEthHandle->Init.RxDesc[ ulChannel ] = xDMADescRx[ ulChannel ];
        }
    #else /* if defined( niEMAC_STM32NX ) */
        static ETH_DMADescTypeDef xDMADescTx[ ETH_TX_DESC_CNT ] __ALIGNED( niEMAC_DATA_ALIGNMENT ) __attribute__( ( section( niEMAC_TX_DESC_SECTION ) ) );
        static ETH_DMADescTypeDef xDMADescRx[ ETH_RX_DESC_CNT ] __ALIGNED( niEMAC_DATA_ALIGNMENT ) __attribute__( ( section( niEMAC_RX_DESC_SECTION ) ) );
        configASSERT( ( ( uintptr_t ) xDMADescTx & niEMAC_DATA_ALIGNMENT_MASK ) == 0U );
        configASSERT( ( ( uintptr_t ) xDMADescRx & niEMAC_DATA_ALIGNMENT_MASK ) == 0U );
        pxEthHandle->Init.TxDesc = xDMADescTx;
        pxEthHandle->Init.RxDesc = xDMADescRx;
    #endif /* if defined( niEMAC_STM32NX ) */
    ( void ) memset( &xDMADescTx, 0, sizeof( xDMADescTx ) );
    ( void ) memset( &xDMADescRx, 0, sizeof( xDMADescRx ) );

    const NetworkEndPoint_t * const pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface );

    if( pxEndPoint != NULL )
    {
        pxEthHandle->Init.MACAddr = ( uint8_t * ) pxEndPoint->xMACAddress.ucBytes;

        if( HAL_ETH_Init( pxEthHandle ) == HAL_OK )
        {
            #if defined( niEMAC_STM32FX )
                /* This function doesn't get called in Fxx driver */
                HAL_ETH_SetMDIOClockRange( pxEthHandle );
            #endif

            if( prvApplyMACDMAConfig( pxEthHandle, NULL ) != pdFALSE )
            {
                #if defined( niEMAC_STM32HNX )
                    prvInitPacketFilter( pxEthHandle, pxInterface );
                #endif

                if( prvInitMacAddresses( pxEthHandle, pxInterface ) != pdFALSE )
                {
                    xResult = pdTRUE;
                }
            }
        }
    }

    if( xResult == pdTRUE )
    {
        #ifdef niEMAC_CACHEABLE
            if( niEMAC_CACHE_ENABLED && ipconfigIS_ENABLED( niEMAC_USE_MPU ) )
            {
                #ifdef niEMAC_MPU
                    configASSERT( niEMAC_MPU_ENABLED != 0 );
                #else
                    configASSERT( pdFALSE );
                #endif
                /* _FLD2VAL( SCB_CCSIDR_LINESIZE, SCB->CCSIDR ) */
            }
        #endif

        #ifdef configPRIO_BITS
            const uint32_t ulPrioBits = configPRIO_BITS;
        #else
            const uint32_t ulPrioBits = __NVIC_PRIO_BITS;
        #endif
        const uint32_t ulPriority = NVIC_GetPriority( niEMAC_ETH_IRQ_NUMBER ) << ( 8U - ulPrioBits );

        if( ulPriority < configMAX_SYSCALL_INTERRUPT_PRIORITY )
        {
            FreeRTOS_debug_printf( ( "prvEthConfigInit: Incorrectly set Ethernet IRQ priority\n" ) );
            NVIC_SetPriority( niEMAC_ETH_IRQ_NUMBER, configMAX_SYSCALL_INTERRUPT_PRIORITY >> ( 8U - ulPrioBits ) );
        }

        if( NVIC_GetEnableIRQ( niEMAC_ETH_IRQ_NUMBER ) == 0 )
        {
            FreeRTOS_debug_printf( ( "prvEthConfigInit: Ethernet IRQ was not enabled by application\n" ) );
            HAL_NVIC_EnableIRQ( niEMAC_ETH_IRQ_NUMBER );
        }

        configASSERT( niEMAC_ETH_CLOCKS_ENABLED() );
    }

    return xResult;
}

