HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                         MAC and Packet Filtering                          */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static BaseType_t prvConfigureMACAddressFilter( ETH_HandleTypeDef * pxEthHandle )
{
    ETH_MACFilterConfigTypeDef xFilterConfig = { 0 };

    if( HAL_ETH_GetMACFilterConfig( pxEthHandle, &xFilterConfig ) != HAL_OK )
    {
        FreeRTOS_debug_printf( ( "prvConfigureMACAddressFilter: HAL_ETH_GetMACFilterConfig failed\n" ) );
        return pdFALSE;
    }

    xFilterConfig.ReceiveAllMode = DISABLE;
    xFilterConfig.HachOrPerfectFilter = ENABLE;
    xFilterConfig.SrcAddrFiltering = DISABLE;
    xFilterConfig.SrcAddrInverseFiltering = DISABLE;
    xFilterConfig.ControlPacketsFilter = ETH_CTRLPACKETS_BLOCK_ALL;
    xFilterConfig.BroadcastFilter = DISABLE;
    xFilterConfig.PassAllMulticast = DISABLE;
    xFilterConfig.DestAddrInverseFiltering = DISABLE;
    xFilterConfig.HashMulticast = ENABLE;
    xFilterConfig.HashUnicast = ENABLE;
    xFilterConfig.PromiscuousMode = DISABLE;

    if( HAL_ETH_SetMACFilterConfig( pxEthHandle, &xFilterConfig ) != HAL_OK )
    {
        FreeRTOS_debug_printf( ( "prvConfigureMACAddressFilter: HAL_ETH_SetMACFilterConfig failed\n" ) );
        return pdFALSE;
    }

    return pdTRUE;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvInitMacAddresses( ETH_HandleTypeDef * pxEthHandle,
                                      NetworkInterface_t * pxInterface )
{
    if( prvConfigureMACAddressFilter( pxEthHandle ) == pdFALSE )
    {
        return pdFALSE;
    }

    prvResetMACAddressFilters( pxEthHandle );

    NetworkEndPoint_t * pxEndPoint;

    for( pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface ); pxEndPoint != NULL; pxEndPoint = FreeRTOS_NextEndPoint( pxInterface, pxEndPoint ) )
    {
        prvAddAllowedMACAddress( pxInterface, pxEndPoint->xMACAddress.ucBytes );
    }

    #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 )
        #if ipconfigIS_ENABLED( ipconfigUSE_MDNS )
            prvAddAllowedMACAddress( pxInterface, xMDNS_MacAddress.ucBytes );
        #endif
        #if ipconfigIS_ENABLED( ipconfigUSE_LLMNR )
            prvAddAllowedMACAddress( pxInterface, xLLMNR_MacAddress.ucBytes );
        #endif
    #endif

    #if ipconfigIS_ENABLED( ipconfigUSE_IPv6 )
        prvAddAllowedMACAddress( pxInterface, pcLOCAL_ALL_NODES_MULTICAST_MAC );
        #if ipconfigIS_ENABLED( ipconfigUSE_MDNS )
            prvAddAllowedMACAddress( pxInterface, xMDNS_MacAddressIPv6.ucBytes );
        #endif
        #if ipconfigIS_ENABLED( ipconfigUSE_LLMNR )
            prvAddAllowedMACAddress( pxInterface, xLLMNR_MacAddressIPv6.ucBytes );
        #endif
    #endif

    return pdTRUE;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvRestoreMACAddressFilters( ETH_HandleTypeDef * pxEthHandle )
{
    if( prvConfigureMACAddressFilter( pxEthHandle ) == pdFALSE )
    {
        return pdFALSE;
    }

    for( uint8_t ucIndex = 0U; ucIndex < niEMAC_MAC_SRC_MATCH_COUNT; ucIndex++ )
    {
        if( ucSrcMatchCounters[ ucIndex ] > 0U )
        {
            prvHAL_ETH_SetDestMACAddrMatch( pxEthHandle->Instance, ucIndex, ucSrcMatchAddresses[ ucIndex ] );
        }
        else
        {
            prvHAL_ETH_ClearDestMACAddrMatch( pxEthHandle->Instance, ucIndex );
        }
    }

    if( HAL_ETH_SetHashTable( pxEthHandle, ulHashTable ) != HAL_OK )
    {
        FreeRTOS_debug_printf( ( "prvRestoreMACAddressFilters: HAL_ETH_SetHashTable failed\n" ) );
        return pdFALSE;
    }

    return pdTRUE;
}

/*---------------------------------------------------------------------------*/

#ifdef niEMAC_STM32HNX

    static void prvInitPacketFilter( ETH_HandleTypeDef * pxEthHandle,
                                     const NetworkInterface_t * const pxInterface )
    {
        ( void ) pxInterface;
        HAL_ETHEx_DisableL3L4Filtering( pxEthHandle );

        #if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM )
        {
            const uint8_t ucFilterCount = _FLD2VAL( ETH_MACHWF1R_L3L4FNUM, pxEthHandle->Instance->MACHWF1R );

            if( ucFilterCount > 0 )
            {
                ETH_MACConfigTypeDef xMACConfig = { 0 };

                if( HAL_ETH_GetMACConfig( pxEthHandle, &xMACConfig ) != HAL_OK )
                {
                    FreeRTOS_debug_printf( ( "prvInitPacketFilter: HAL_ETH_GetMACConfig failed\n" ) );
                    return;
                }

                if( xMACConfig.ChecksumOffload != ENABLE )
                {
                    /* "The Layer 3 and Layer 4 Packet Filter feature automatically selects the IPC Full Checksum
                     * Offload Engine on the Receive side. When this feature is enabled, you must set the IPC bit." */
                    xMACConfig.ChecksumOffload = ENABLE;

                    if( HAL_ETH_SetMACConfig( pxEthHandle, &xMACConfig ) != HAL_OK )
                    {
                        FreeRTOS_debug_printf( ( "prvInitPacketFilter: HAL_ETH_SetMACConfig failed\n" ) );
                        return;
                    }
                }

                #if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES )
                {
                    #if ipconfigIS_DISABLED( ipconfigUSE_IPv4 ) || ipconfigIS_DISABLED( ipconfigUSE_IPv6 )
                        ETH_L3FilterConfigTypeDef xL3FilterConfig = { 0 };
                    #endif

                    /* Filter out all possibilities if frame type is disabled */
                    #if ipconfigIS_DISABLED( ipconfigUSE_IPv4 )
                        /* Block IPv4 if it is disabled */
                        if( HAL_ETHEx_GetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_0, &xL3FilterConfig ) != HAL_OK )
                        {
                            FreeRTOS_debug_printf( ( "prvInitPacketFilter: HAL_ETHEx_GetL3FilterConfig failed\n" ) );
                            return;
                        }
                        xL3FilterConfig.Protocol = ETH_L3_IPV4_MATCH;
                        xL3FilterConfig.SrcAddrFilterMatch = ETH_L3_SRC_ADDR_PERFECT_MATCH_ENABLE;
                        xL3FilterConfig.DestAddrFilterMatch = ETH_L3_DEST_ADDR_PERFECT_MATCH_ENABLE;
                        xL3FilterConfig.SrcAddrHigherBitsMatch = 0x1FU;
                        xL3FilterConfig.DestAddrHigherBitsMatch = 0x1FU;
                        xL3FilterConfig.Ip4SrcAddr = FREERTOS_INADDR_BROADCAST;
                        xL3FilterConfig.Ip4DestAddr = FREERTOS_INADDR_BROADCAST;
                        if( HAL_ETHEx_SetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_0, &xL3FilterConfig ) != HAL_OK )
                        {
                            FreeRTOS_debug_printf( ( "prvInitPacketFilter: HAL_ETHEx_SetL3FilterConfig failed\n" ) );
                            return;
                        }
                    #endif /* if ipconfigIS_DISABLED( ipconfigUSE_IPv4 ) */

                    #if ipconfigIS_DISABLED( ipconfigUSE_IPv6 )
                        /* Block IPv6 if it is disabled */
                        if( HAL_ETHEx_GetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_1, &xL3FilterConfig ) != HAL_OK )
                        {
                            FreeRTOS_debug_printf( ( "prvInitPacketFilter: HAL_ETHEx_GetL3FilterConfig failed\n" ) );
                            return;
                        }
                        xL3FilterConfig.Protocol = ETH_L3_IPV6_MATCH;
                        xL3FilterConfig.SrcAddrFilterMatch = ETH_L3_SRC_ADDR_PERFECT_MATCH_ENABLE;
                        xL3FilterConfig.DestAddrFilterMatch = ETH_L3_DEST_ADDR_PERFECT_MATCH_ENABLE;
                        xL3FilterConfig.SrcAddrHigherBitsMatch = 0x1FU;
                        xL3FilterConfig.DestAddrHigherBitsMatch = 0x1FU;
                        xL3FilterConfig.Ip6Addr[ 0 ] = 0xFFFFFFFFU;
                        xL3FilterConfig.Ip6Addr[ 1 ] = 0xFFFFFFFFU;
                        xL3FilterConfig.Ip6Addr[ 2 ] = 0xFFFFFFFFU;
                        xL3FilterConfig.Ip6Addr[ 3 ] = 0xFFFFFFFFU;
                        if( HAL_ETHEx_SetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_1, &xL3FilterConfig ) != HAL_OK )
                        {
                            FreeRTOS_debug_printf( ( "prvInitPacketFilter: HAL_ETHEx_SetL3FilterConfig failed\n" ) );
                            return;
                        }
                    #endif /* if ipconfigIS_DISABLED( ipconfigUSE_IPv6 ) */

