HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
                    /* TODO: Handle multiple endpoints */
                    #if 0
                        for( NetworkEndPoint_t * pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface ); pxEndPoint != NULL; pxEndPoint = FreeRTOS_NextEndPoint( pxInterface, pxEndPoint ) )
                        {
                            if( ENDPOINT_IS_IPv4( pxEndPoint ) )
                            {
                                #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 )
                                    ( void ) HAL_ETHEx_GetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_0, &xL3FilterConfig );
                                    xL3FilterConfig.Protocol = ETH_L3_IPV4_MATCH;
                                    xL3FilterConfig.SrcAddrFilterMatch = ETH_L3_SRC_ADDR_MATCH_DISABLE;
                                    xL3FilterConfig.DestAddrFilterMatch = ETH_L3_DEST_ADDR_MATCH_DISABLE;
                                    xL3FilterConfig.SrcAddrHigherBitsMatch = 0U /* Don't Care */;
                                    xL3FilterConfig.DestAddrHigherBitsMatch = 0x1FU;
                                    xL3FilterConfig.Ip4SrcAddr = 0U /* Don't Care */;
                                    xL3FilterConfig.Ip4DestAddr = pxEndPoint->ipv4_settings.ulIPAddress;
                                    ( void ) HAL_ETHEx_SetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_0, &xL3FilterConfig );
                                #endif
                            }
                            else if( ENDPOINT_IS_IPv6( pxEndPoint ) )
                            {
                                #if ipconfigIS_ENABLED( ipconfigUSE_IPv6 )
                                    ( void ) HAL_ETHEx_GetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_1, &xL3FilterConfig );
                                    xL3FilterConfig.Protocol = ETH_L3_IPV6_MATCH;
                                    xL3FilterConfig.SrcAddrFilterMatch = ETH_L3_SRC_ADDR_MATCH_DISABLE;
                                    xL3FilterConfig.DestAddrFilterMatch = ETH_L3_DEST_ADDR_MATCH_DISABLE;
                                    xL3FilterConfig.SrcAddrHigherBitsMatch = 0U; /* Don't Care */
                                    xL3FilterConfig.DestAddrHigherBitsMatch = 0x1FU;
                                    xL3FilterConfig.Ip6Addr[ 0 ] = 0xFFFFFFFFU;
                                    xL3FilterConfig.Ip6Addr[ 1 ] = 0xFFFFFFFFU;
                                    xL3FilterConfig.Ip6Addr[ 2 ] = 0xFFFFFFFFU;
                                    xL3FilterConfig.Ip6Addr[ 3 ] = 0xFFFFFFFFU;
                                    ( void ) HAL_ETHEx_SetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_1, &xL3FilterConfig );
                                #endif /* if ipconfigIS_ENABLED( ipconfigUSE_IPv6 ) */
                            }
                        }
                    #endif /* if 0 */
                }
                #endif /* if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES ) */

                #if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )
                {
                    /* TODO: Let user to block certain port numbers */
                    /* TODO: Live updated in task based on active sockets? */
                    ETH_L4FilterConfigTypeDef xL4FilterConfig = { 0 };

                    /* Always allow all UDP */
                    if( HAL_ETHEx_GetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_0, &xL4FilterConfig ) != HAL_OK )
                    {
                        FreeRTOS_debug_printf( ( "prvInitPacketFilter: HAL_ETHEx_GetL4FilterConfig failed\n" ) );
                        return;
                    }
                    xL4FilterConfig.Protocol = ETH_L4_UDP_MATCH;
                    xL4FilterConfig.SrcPortFilterMatch = ETH_L4_SRC_PORT_MATCH_DISABLE;
                    xL4FilterConfig.DestPortFilterMatch = ETH_L4_DEST_PORT_MATCH_DISABLE;
                    xL4FilterConfig.SourcePort = 0U;
                    xL4FilterConfig.DestinationPort = 0U;
                    if( HAL_ETHEx_SetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_0, &xL4FilterConfig ) != HAL_OK )
                    {
                        FreeRTOS_debug_printf( ( "prvInitPacketFilter: HAL_ETHEx_SetL4FilterConfig failed\n" ) );
                        return;
                    }

                    #if ipconfigIS_DISABLED( ipconfigUSE_TCP )
                        /* Block TCP if it is disabled */
                        if( HAL_ETHEx_GetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_1, &xL4FilterConfig ) != HAL_OK )
                        {
                            FreeRTOS_debug_printf( ( "prvInitPacketFilter: HAL_ETHEx_GetL4FilterConfig failed\n" ) );
                            return;
                        }
                        xL4FilterConfig.Protocol = ETH_L4_TCP_MATCH;
                        xL4FilterConfig.SrcPortFilterMatch = ETH_L4_SRC_PORT_PERFECT_MATCH_ENABLE;
                        xL4FilterConfig.DestPortFilterMatch = ETH_L4_DEST_PORT_PERFECT_MATCH_ENABLE;
                        xL4FilterConfig.SourcePort = 0xFFFFU;
                        xL4FilterConfig.DestinationPort = 0xFFFFU;
                        if( HAL_ETHEx_SetL4FilterConfig( pxEthHandle, ETH_L4_FILTER_1, &xL4FilterConfig ) != HAL_OK )
                        {
                            FreeRTOS_debug_printf( ( "prvInitPacketFilter: HAL_ETHEx_SetL4FilterConfig failed\n" ) );
                            return;
                        }
                    #endif
                }
                #endif /* if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS ) */

                HAL_ETHEx_EnableL3L4Filtering( pxEthHandle );
            }
        }
        #endif /* if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM ) */
    }

#endif /* ifdef niEMAC_STM32HNX */

/*---------------------------------------------------------------------------*/

/* Compute the CRC32 of the given MAC address as per IEEE 802.3 CRC32 */
static uint32_t prvCalcCrc32( const uint8_t * const pucMACAddr )
{
    uint32_t ulCRC32 = 0xFFFFFFFFU;

    uint32_t ucIndex;

