HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
    for( ucIndex = ipMAC_ADDRESS_LENGTH_BYTES; ucIndex > 0; --ucIndex )
    {
        ulCRC32 ^= __RBIT( pucMACAddr[ ipMAC_ADDRESS_LENGTH_BYTES - ucIndex ] );

        uint8_t ucJndex;

        for( ucJndex = 8; ucJndex > 0; --ucJndex )
        {
            if( ulCRC32 & 0x80000000U )
            {
                ulCRC32 <<= 1;
                ulCRC32 ^= niEMAC_CRC_POLY;
            }
            else
            {
                ulCRC32 <<= 1;
            }
        }
    }

    return ~ulCRC32;
}

/*---------------------------------------------------------------------------*/

static uint8_t prvGetMacHashIndex( const uint8_t * const pucMACAddr )
{
    const uint32_t ulHash = prvCalcCrc32( pucMACAddr );
    const uint8_t ucHashIndex = ( uint8_t ) ( ( ulHash >> 26 ) & 0x3FU );

    return ucHashIndex;
}

/*---------------------------------------------------------------------------*/

/* Needed since HAL Driver only provides source matching */
static void prvHAL_ETH_SetDestMACAddrMatch( ETH_TypeDef * const pxEthInstance,
                                            uint8_t ucIndex,
                                            const uint8_t * const pucMACAddr )
{
    configASSERT( ucIndex < niEMAC_MAC_SRC_MATCH_COUNT );
    const uint32_t ulMacAddrHigh = ( ( uint32_t ) pucMACAddr[ 5 ] << 8 ) | ( uint32_t ) pucMACAddr[ 4 ];
    const uint32_t ulMacAddrLow = ( ( uint32_t ) pucMACAddr[ 3 ] << 24 ) | ( ( uint32_t ) pucMACAddr[ 2 ] << 16 ) | ( ( uint32_t ) pucMACAddr[ 1 ] << 8 ) | ( uint32_t ) pucMACAddr[ 0 ];

    /* MACA0HR/MACA0LR reserved for the primary MAC-address. */
    const uintptr_t uxMacRegHigh = ( uintptr_t ) &( pxEthInstance->MACA1HR ) + ( 8U * ucIndex );
    const uintptr_t uxMacRegLow = ( uintptr_t ) &( pxEthInstance->MACA1LR ) + ( 8U * ucIndex );
    ( void ) memcpy( ucSrcMatchAddresses[ ucIndex ], pucMACAddr, ipMAC_ADDRESS_LENGTH_BYTES );
    ( *( __IO uint32_t * ) uxMacRegHigh ) = niEMAC_MAC_ADDRESS_ENABLE_FLAG | ulMacAddrHigh;
    ( *( __IO uint32_t * ) uxMacRegLow ) = ulMacAddrLow;
}

/*---------------------------------------------------------------------------*/

static void prvHAL_ETH_ClearDestMACAddrMatch( ETH_TypeDef * const pxEthInstance,
                                              uint8_t ucIndex )
{
    configASSERT( ucIndex < niEMAC_MAC_SRC_MATCH_COUNT );
    const uintptr_t uxMacRegHigh = ( uintptr_t ) &( pxEthInstance->MACA1HR ) + ( 8U * ucIndex );
    const uintptr_t uxMacRegLow = ( uintptr_t ) &( pxEthInstance->MACA1LR ) + ( 8U * ucIndex );
    ( *( __IO uint32_t * ) uxMacRegHigh ) = 0U;
    ( *( __IO uint32_t * ) uxMacRegLow ) = 0U;
    ( void ) memset( ucSrcMatchAddresses[ ucIndex ], 0, ipMAC_ADDRESS_LENGTH_BYTES );
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvAddDestMACAddrMatch( ETH_TypeDef * const pxEthInstance,
                                          const uint8_t * const pucMACAddr )
{
    BaseType_t xResult = pdFALSE;
    ( void ) pxEthInstance;

    uint8_t ucIndex;

    for( ucIndex = 0; ucIndex < niEMAC_MAC_SRC_MATCH_COUNT; ++ucIndex )
    {
        if( ucSrcMatchCounters[ ucIndex ] > 0U )
        {
            if( memcmp( ucSrcMatchAddresses[ ucIndex ], pucMACAddr, ipMAC_ADDRESS_LENGTH_BYTES ) == 0 )
            {
                if( ucSrcMatchCounters[ ucIndex ] < UINT8_MAX )
                {
                    ++( ucSrcMatchCounters[ ucIndex ] );
                }

                xResult = pdTRUE;
                break;
            }
        }
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvRemoveDestMACAddrMatch( ETH_TypeDef * const pxEthInstance,
                                             const uint8_t * const pucMACAddr )
{
    BaseType_t xResult = pdFALSE;

    uint8_t ucIndex;

    for( ucIndex = 0; ucIndex < niEMAC_MAC_SRC_MATCH_COUNT; ++ucIndex )
    {
        if( ucSrcMatchCounters[ ucIndex ] > 0U )
        {
            if( memcmp( ucSrcMatchAddresses[ ucIndex ], pucMACAddr, ipMAC_ADDRESS_LENGTH_BYTES ) == 0 )
            {
                /* A saturated reference count cannot be decremented safely: its
                 * true value is unknown. Keep accepting the address instead of
                 * clearing an entry that may still have users. */
                if( ( ucSrcMatchCounters[ ucIndex ] < UINT8_MAX ) &&
                    ( --( ucSrcMatchCounters[ ucIndex ] ) == 0U ) )
                {
                    prvHAL_ETH_ClearDestMACAddrMatch( pxEthInstance, ucIndex );
                }

                xResult = pdTRUE;
                break;
            }
        }
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvSetNewDestMACAddrMatch( ETH_TypeDef * const pxEthInstance,
                                             uint8_t ucHashIndex,
                                             const uint8_t * const pucMACAddr )
{
    BaseType_t xResult = pdFALSE;

    if( ucAddrHashCounters[ ucHashIndex ] == 0U )
    {
        uint8_t ucIndex;

        for( ucIndex = 0U; ucIndex < niEMAC_MAC_SRC_MATCH_COUNT; ++ucIndex )
        {
            if( ucSrcMatchCounters[ ucIndex ] == 0U )
            {
                prvHAL_ETH_SetDestMACAddrMatch( pxEthInstance, ucIndex, pucMACAddr );
                ucSrcMatchCounters[ ucIndex ] = 1U;
                xResult = pdTRUE;
                break;
            }
        }
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static void prvAddDestMACAddrHash( ETH_HandleTypeDef * pxEthHandle,
                                   uint8_t ucHashIndex )
{
    if( ucAddrHashCounters[ ucHashIndex ] == 0 )
    {
        if( ( ucHashIndex & 0x20U ) != 0U )
        {
            ulHashTable[ niEMAC_HASH_TABLE_HIGH_WORD_INDEX ] |= ( 1U << ( ucHashIndex & 0x1FU ) );
        }
        else
        {
            ulHashTable[ niEMAC_HASH_TABLE_LOW_WORD_INDEX ] |= ( 1U << ucHashIndex );
        }

