HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
        HAL_ETH_SetHashTable( pxEthHandle, ulHashTable );
    }

    if( ucAddrHashCounters[ ucHashIndex ] < UINT8_MAX )
    {
        ++( ucAddrHashCounters[ ucHashIndex ] );
    }
}

/*---------------------------------------------------------------------------*/

static void prvRemoveDestMACAddrHash( ETH_HandleTypeDef * pxEthHandle,
                                      const uint8_t * const pucMACAddr )
{
    const uint8_t ucHashIndex = prvGetMacHashIndex( pucMACAddr );

    if( ucAddrHashCounters[ ucHashIndex ] > 0U )
    {
        if( ( ucAddrHashCounters[ ucHashIndex ] < UINT8_MAX ) &&
            ( --( ucAddrHashCounters[ ucHashIndex ] ) == 0U ) )
        {
            if( ( ucHashIndex & 0x20U ) != 0U )
            {
                ulHashTable[ niEMAC_HASH_TABLE_HIGH_WORD_INDEX ] &= ~( 1U << ( ucHashIndex & 0x1FU ) );
            }
            else
            {
                ulHashTable[ niEMAC_HASH_TABLE_LOW_WORD_INDEX ] &= ~( 1U << ucHashIndex );
            }

            ( void ) HAL_ETH_SetHashTable( pxEthHandle, ulHashTable );
        }
    }
}

/*---------------------------------------------------------------------------*/

static void prvResetMACAddressFilters( ETH_HandleTypeDef * pxEthHandle )
{
    ( void ) memset( ucSrcMatchCounters, 0, sizeof( ucSrcMatchCounters ) );
    ( void ) memset( ucSrcMatchAddresses, 0, sizeof( ucSrcMatchAddresses ) );
    ( void ) memset( ulHashTable, 0, sizeof( ulHashTable ) );
    ( void ) memset( ucAddrHashCounters, 0, sizeof( ucAddrHashCounters ) );

    if( ( pxEthHandle == NULL ) || ( pxEthHandle->Instance == NULL ) )
    {
        return;
    }

    for( uint8_t ucIndex = 0U; ucIndex < niEMAC_MAC_SRC_MATCH_COUNT; ++ucIndex )
    {
        prvHAL_ETH_ClearDestMACAddrMatch( pxEthHandle->Instance, ucIndex );
    }

    if( HAL_ETH_SetHashTable( pxEthHandle, ulHashTable ) != HAL_OK )
    {
        FreeRTOS_debug_printf( ( "prvResetMACAddressFilters: HAL_ETH_SetHashTable failed\n" ) );
    }
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                              EMAC Helpers                                 */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/
static void prvReleaseTxPacket( ETH_HandleTypeDef * pxEthHandle )
{
    if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( niEMAC_TX_MAX_BLOCK_TIME_MS ) ) != pdFALSE )
    {
        uint32_t ulBuffersReleased = 0U;

        #if defined( niEMAC_STM32NX )
            pxEthHandle->TxOpCH = niEMAC_DMA_CHANNEL_INDEX;
        #endif

        /* Each transmission consumes one HAL buffer and one semaphore slot. */
        const uint32_t ulBuffersBeforeRelease = HAL_ETH_GetTxBuffersNumber( pxEthHandle );
        const HAL_StatusTypeDef xReleaseStatus = HAL_ETH_ReleaseTxPacket( pxEthHandle );
        const uint32_t ulBuffersAfterRelease = HAL_ETH_GetTxBuffersNumber( pxEthHandle );

        configASSERT( xReleaseStatus == HAL_OK );
        configASSERT( ulBuffersAfterRelease <= ulBuffersBeforeRelease );

        if( ( xReleaseStatus == HAL_OK ) && ( ulBuffersAfterRelease <= ulBuffersBeforeRelease ) )
        {
            ulBuffersReleased = ulBuffersBeforeRelease - ulBuffersAfterRelease;
        }

        for( uint32_t ulIndex = 0U; ulIndex < ulBuffersReleased; ulIndex++ )
        {
            const BaseType_t xGiveResult = xSemaphoreGive( xTxDescSem );

            configASSERT( xGiveResult == pdTRUE );

            if( xGiveResult != pdTRUE )
            {
                break;
            }
        }

        ( void ) xSemaphoreGive( xTxMutex );
    }
    else
    {
        FreeRTOS_debug_printf( ( "prvReleaseTxPacket: Failed\n" ) );
    }
}

/*---------------------------------------------------------------------------*/

static void prvReleaseNetworkBufferDescriptor( NetworkBufferDescriptor_t * const pxDescriptor )
{
    NetworkBufferDescriptor_t * pxDescriptorToClear = pxDescriptor;

    while( pxDescriptorToClear != NULL )
    {
        #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
            NetworkBufferDescriptor_t * const pxNext = pxDescriptorToClear->pxNextBuffer;
        #else
            NetworkBufferDescriptor_t * const pxNext = NULL;
        #endif
        vReleaseNetworkBufferAndDescriptor( pxDescriptorToClear );
        pxDescriptorToClear = pxNext;
    }
}

/*---------------------------------------------------------------------------*/

static void prvSendRxEvent( NetworkBufferDescriptor_t * const pxDescriptor )
{
    const IPStackEvent_t xRxEvent =
    {
        .eEventType = eNetworkRxEvent,
        .pvData     = ( void * ) pxDescriptor
    };

    if( xSendEventStructToIPTask( &xRxEvent, pdMS_TO_TICKS( niEMAC_RX_MAX_BLOCK_TIME_MS ) ) != pdPASS )
    {
        iptraceETHERNET_RX_EVENT_LOST();
        FreeRTOS_debug_printf( ( "prvSendRxEvent: xSendEventStructToIPTask failed\n" ) );
        prvReleaseNetworkBufferDescriptor( pxDescriptor );
    }
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvAcceptPacket( ETH_HandleTypeDef * pxEthHandle,
                                   NetworkInterface_t * pxInterface,
                                   NetworkBufferDescriptor_t * pxDescriptor )
{
    BaseType_t xResult = pdFALSE;

    do
    {
        if( ( pxEthHandle == NULL ) || ( pxInterface == NULL ) ||
            ( pxDescriptor == NULL ) || ( pxDescriptor->pucEthernetBuffer == NULL ) )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Invalid argument\n" ) );
            break;
        }

        if( ( pxDescriptor->xDataLength < sizeof( EthernetHeader_t ) ) ||
            ( pxDescriptor->xDataLength > niEMAC_DATA_BUFFER_SIZE ) )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Invalid packet size\n" ) );
            break;
        }

        const EthernetHeader_t * const pxEthernetHeader = ( const EthernetHeader_t * const ) pxDescriptor->pucEthernetBuffer;
        size_t uxMinimumLength = sizeof( EthernetHeader_t );

        switch( pxEthernetHeader->usFrameType )
        {
            #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 )
                case ipARP_FRAME_TYPE:
                    uxMinimumLength = sizeof( ARPPacket_t );
                    break;

                case ipIPv4_FRAME_TYPE:
                    uxMinimumLength = sizeof( IPPacket_t );
                    break;
            #endif

            #if ipconfigIS_ENABLED( ipconfigUSE_IPv6 )
                case ipIPv6_FRAME_TYPE:
                    uxMinimumLength = sizeof( IPPacket_IPv6_t );
                    break;
            #endif

            default:
                break;
        }

        if( pxDescriptor->xDataLength < uxMinimumLength )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Packet too short\n" ) );
            break;
        }

        uint32_t ulErrorCode = 0U;

        if( HAL_ETH_GetRxDataErrorCode( pxEthHandle, &ulErrorCode ) != HAL_OK )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Failed to read Rx data error\n" ) );
            break;
        }

