HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
        if( ulErrorCode != 0U )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Rx data error\n" ) );
            break;
        }

        #if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES )
            if( eConsiderFrameForProcessing( pxDescriptor->pucEthernetBuffer ) != eProcessBuffer )
            {
                iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvAcceptPacket: Frame discarded\n" ) );
                break;
            }
        #endif

        pxDescriptor->pxInterface = pxInterface;
        pxDescriptor->pxEndPoint = FreeRTOS_MatchingEndpoint( pxInterface, pxDescriptor->pucEthernetBuffer );

        if( pxDescriptor->pxEndPoint == NULL )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: No matching endpoint\n" ) );
            break;
        }

        #if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )
            if( prvPassesPacketFilter( pxDescriptor ) == pdFALSE )
            {
                iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvAcceptPacket: Packet discarded\n" ) );
                break;
            }
        #endif

        xResult = pdTRUE;
    } while( pdFALSE );

    return xResult;
}

/*---------------------------------------------------------------------------*/

#if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )

    static BaseType_t prvPassesPacketFilter( const NetworkBufferDescriptor_t * const pxDescriptor )
    {
        const EthernetHeader_t * const pxEthernetHeader = ( const EthernetHeader_t * const ) pxDescriptor->pucEthernetBuffer;
        const NetworkEndPoint_t * const pxEndPoint = pxDescriptor->pxEndPoint;

        #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 )
            if( pxEthernetHeader->usFrameType == ipARP_FRAME_TYPE )
            {
                return pdTRUE;
            }

            if( pxEthernetHeader->usFrameType == ipIPv4_FRAME_TYPE )
            {
                if( ENDPOINT_IS_IPv4( pxEndPoint ) == pdFALSE )
                {
                    return pdFALSE;
                }

                const IPPacket_t * const pxIPPacket = ( const IPPacket_t * const ) pxDescriptor->pucEthernetBuffer;
                const IPHeader_t * const pxIPHeader = &( pxIPPacket->xIPHeader );
                const uint32_t ulDestinationIPAddress = pxIPHeader->ulDestinationIPAddress;
                const uint32_t ulSourceIPAddress = pxIPHeader->ulSourceIPAddress;

                if( ( pxIPHeader->ucVersionHeaderLength < ipIPV4_VERSION_HEADER_LENGTH_MIN ) ||
                    ( pxIPHeader->ucVersionHeaderLength > ipIPV4_VERSION_HEADER_LENGTH_MAX ) )
                {
                    return pdFALSE;
                }

                if( ( ( pxIPHeader->usFragmentOffset & ipFRAGMENT_OFFSET_BIT_MASK ) != 0U ) ||
                    ( ( pxIPHeader->usFragmentOffset & ipFRAGMENT_FLAGS_MORE_FRAGMENTS ) != 0U ) )
                {
                    return pdFALSE;
                }

                if( xBadIPv4Loopback( pxIPHeader ) == pdTRUE )
                {
                    return pdFALSE;
                }

                if( memcmp( xBroadcastMACAddress.ucBytes,
                            pxEthernetHeader->xSourceAddress.ucBytes,
                            sizeof( MACAddress_t ) ) == 0 )
                {
                    return pdFALSE;
                }

                if( xIsIPv4Multicast( ulSourceIPAddress ) == pdTRUE )
                {
                    return pdFALSE;
                }

                if( FreeRTOS_IsEndPointUp( pxEndPoint ) != pdFALSE )
                {
                    if( ( ulDestinationIPAddress != pxEndPoint->ipv4_settings.ulIPAddress ) &&
                        ( ulDestinationIPAddress != pxEndPoint->ipv4_settings.ulBroadcastAddress ) &&
                        ( ulDestinationIPAddress != FREERTOS_INADDR_BROADCAST ) &&
                        ( xIsIPv4Multicast( ulDestinationIPAddress ) == pdFALSE ) )
                    {
                        return pdFALSE;
                    }

                    if( ( ulSourceIPAddress == pxEndPoint->ipv4_settings.ulBroadcastAddress ) ||
                        ( ulSourceIPAddress == FREERTOS_INADDR_BROADCAST ) )
                    {
                        return pdFALSE;
                    }

                    if( ( memcmp( xBroadcastMACAddress.ucBytes,
                                  pxEthernetHeader->xDestinationAddress.ucBytes,
                                  sizeof( MACAddress_t ) ) == 0 ) &&
                        ( ulDestinationIPAddress != pxEndPoint->ipv4_settings.ulBroadcastAddress ) &&
                        ( ulDestinationIPAddress != FREERTOS_INADDR_BROADCAST ) )
                    {
                        return pdFALSE;
                    }
                }
                else if( memcmp( xBroadcastMACAddress.ucBytes,
                                 pxEthernetHeader->xDestinationAddress.ucBytes,
                                 sizeof( MACAddress_t ) ) == 0 )
                {
                    if( ulDestinationIPAddress != FREERTOS_INADDR_BROADCAST )
                    {
                        return pdFALSE;
                    }
                }
                else if( memcmp( pxEndPoint->xMACAddress.ucBytes,
                                 pxEthernetHeader->xDestinationAddress.ucBytes,
                                 sizeof( MACAddress_t ) ) != 0 )
                {
                    return pdFALSE;
                }

                return pdTRUE;
            }
        #endif /* ipconfigUSE_IPv4 */

        #if ipconfigIS_ENABLED( ipconfigUSE_IPv6 )
            if( pxEthernetHeader->usFrameType == ipIPv6_FRAME_TYPE )
            {
                if( ENDPOINT_IS_IPv6( pxEndPoint ) == pdFALSE )
                {
                    return pdFALSE;
                }

