HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
                const IPPacket_IPv6_t * const pxIPv6Packet = ( const IPPacket_IPv6_t * const ) pxDescriptor->pucEthernetBuffer;
                const IPHeader_IPv6_t * const pxIPv6Header = &( pxIPv6Packet->xIPHeader );
                const IPv6_Address_t * const pxDestinationIPAddress = &( pxIPv6Header->xDestinationAddress );
                const IPv6_Address_t * const pxSourceIPAddress = &( pxIPv6Header->xSourceAddress );

                if( ( ( pxIPv6Header->ucVersionTrafficClass & ( uint8_t ) 0xF0U ) >> 4 ) != 6U )
                {
                    return pdFALSE;
                }

                if( ( memcmp( pxDestinationIPAddress->ucBytes, FreeRTOS_in6addr_any.ucBytes, sizeof( IPv6_Address_t ) ) == 0 ) ||
                    ( memcmp( pxSourceIPAddress->ucBytes, FreeRTOS_in6addr_any.ucBytes, sizeof( IPv6_Address_t ) ) == 0 ) )
                {
                    return pdFALSE;
                }

                if( ( xIsIPv6Loopback( pxSourceIPAddress ) == pdTRUE ) ||
                    ( xIsIPv6Loopback( pxDestinationIPAddress ) == pdTRUE ) )
                {
                    return pdFALSE;
                }

                if( ( memcmp( pxDestinationIPAddress->ucBytes,
                              pxEndPoint->ipv6_settings.xIPAddress.ucBytes,
                              sizeof( IPv6_Address_t ) ) != 0 ) &&
                    ( xIsIPv6AllowedMulticast( pxDestinationIPAddress ) == pdFALSE ) &&
                    ( FreeRTOS_IsNetworkUp() != 0 ) )
                {
                    return pdFALSE;
                }

                return pdTRUE;
            }
        #endif /* ipconfigUSE_IPv6 */

        #if ipconfigIS_ENABLED( ipconfigPROCESS_CUSTOM_ETHERNET_FRAMES )
            return pdTRUE;
        #else
            return pdFALSE;
        #endif
    }

#endif /* ipconfigETHERNET_DRIVER_FILTERS_PACKETS */

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                              IRQ Handlers                                 */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

void niEMAC_ETH_IRQ_HANDLER( void )
{
    traceISR_ENTER();

    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;

    xSwitchRequired = pdFALSE;

    if( pxEthHandle->Instance != NULL )
    {
        HAL_ETH_IRQHandler( pxEthHandle );
    }

    portYIELD_FROM_ISR( xSwitchRequired );
}

/*---------------------------------------------------------------------------*/

void HAL_ETH_ErrorCallback( ETH_HandleTypeDef * pxEthHandle )
{
    eMAC_IF_EVENT eErrorEvents = eMacEventNone;
    const uint32_t ulErrorCode = HAL_ETH_GetError( pxEthHandle );

    if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_ERROR )
    {
        /* Fatal bus error occurred */
        eErrorEvents |= eMacEventErrEth;
    }

    if( ( ulErrorCode & niEMAC_DMA_ERROR_MASK ) != 0 )
    {
        eErrorEvents |= eMacEventErrDma;
        const uint32_t ulDmaError = HAL_ETH_GetDMAError( pxEthHandle );

        if( ( ulDmaError & niEMAC_DMA_TX_BUFFER_UNAVAILABLE_FLAG ) != 0 )
        {
            eErrorEvents |= eMacEventErrTx;
        }

        if( ( ulDmaError & niEMAC_DMA_RX_BUFFER_UNAVAILABLE_FLAG ) != 0 )
        {
            eErrorEvents |= eMacEventErrRx;
        }
    }

    if( ( ulErrorCode & HAL_ETH_ERROR_MAC ) != 0 )
    {
        eErrorEvents |= eMacEventErrMac;
    }

    if( ( xEMACTaskHandle != NULL ) && ( eErrorEvents != eMacEventNone ) )
    {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eErrorEvents, eSetBits, &xHigherPriorityTaskWoken );
        xSwitchRequired |= xHigherPriorityTaskWoken;
    }
}

/*---------------------------------------------------------------------------*/

void HAL_ETH_RxCpltCallback( ETH_HandleTypeDef * pxEthHandle )
{
    static size_t uxMostRXDescsUsed = 0U;

    for( uint32_t ulChannel = 0; ulChannel < niEMAC_RX_CHANNEL_COUNT; ulChannel++ )
    {
        const size_t uxRxUsed = niEMAC_RX_DESC_LIST( pxEthHandle, ulChannel ).RxDescCnt;

        if( uxMostRXDescsUsed < uxRxUsed )
        {
            uxMostRXDescsUsed = uxRxUsed;
        }
    }

    iptraceNETWORK_INTERFACE_RECEIVE();

    if( xEMACTaskHandle != NULL )
    {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eMacEventRx, eSetBits, &xHigherPriorityTaskWoken );
        xSwitchRequired |= xHigherPriorityTaskWoken;
    }
}

/*---------------------------------------------------------------------------*/

void HAL_ETH_TxCpltCallback( ETH_HandleTypeDef * pxEthHandle )
{
    static size_t uxMostTXDescsUsed = 0U;

    for( uint32_t ulChannel = 0; ulChannel < niEMAC_TX_CHANNEL_COUNT; ulChannel++ )
    {
        const size_t uxTxUsed = niEMAC_TX_DESC_LIST( pxEthHandle, ulChannel ).BuffersInUse;

        if( uxMostTXDescsUsed < uxTxUsed )
        {
            uxMostTXDescsUsed = uxTxUsed;
        }
    }

    iptraceNETWORK_INTERFACE_TRANSMIT();

    if( xEMACTaskHandle != NULL )
    {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eMacEventTx, eSetBits, &xHigherPriorityTaskWoken );
        xSwitchRequired |= xHigherPriorityTaskWoken;
    }
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                            HAL Tx/Rx Callbacks                            */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

void HAL_ETH_RxAllocateCallback( uint8_t ** ppucBuff )
{
    if( ppucBuff == NULL )
    {
        return;
    }

    const NetworkBufferDescriptor_t * pxBufferDescriptor = pxGetNetworkBufferWithDescriptor( niEMAC_DATA_BUFFER_SIZE, pdMS_TO_TICKS( niEMAC_DESCRIPTOR_WAIT_TIME_MS ) );

    if( pxBufferDescriptor != NULL )
    {
        #ifdef niEMAC_CACHEABLE
            if( niEMAC_CACHE_MAINTENANCE != 0 )
            {
                /* The hidden network-buffer pointer can share the first cache
                 * line with the Ethernet payload. Clean it before invalidating
                 * the complete DMA receive range. */
                prvCacheCleanInvalidateByAddr( pxBufferDescriptor->pucEthernetBuffer, niEMAC_DATA_BUFFER_SIZE );
            }
        #endif
        *ppucBuff = pxBufferDescriptor->pucEthernetBuffer;
    }
    else
    {
        FreeRTOS_debug_printf( ( "HAL_ETH_RxAllocateCallback: failed\n" ) );
        *ppucBuff = NULL;
    }
}

