HTRamsey/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/

void HAL_ETH_RxLinkCallback( void ** ppvStart,
                             void ** ppvEnd,
                             uint8_t * pucBuff,
                             uint16_t usLength )
{
    if( ( ppvStart == NULL ) || ( ppvEnd == NULL ) )
    {
        FreeRTOS_debug_printf( ( "HAL_ETH_RxLinkCallback: Invalid callback context\n" ) );
        xDropCurrentRxFrame = pdTRUE;

        if( pucBuff != NULL )
        {
            NetworkBufferDescriptor_t * const pxCurDescriptor = pxPacketBuffer_to_NetworkBuffer( ( const void * ) pucBuff );

            if( pxCurDescriptor != NULL )
            {
                prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
            }
        }

        return;
    }

    NetworkBufferDescriptor_t ** const ppxStartDescriptor = ( NetworkBufferDescriptor_t ** ) ppvStart;
    NetworkBufferDescriptor_t ** const ppxEndDescriptor = ( NetworkBufferDescriptor_t ** ) ppvEnd;

    if( pucBuff == NULL )
    {
        FreeRTOS_debug_printf( ( "HAL_ETH_RxLinkCallback: NULL buffer pointer\n" ) );

        if( *ppxStartDescriptor != NULL )
        {
            NetworkBufferDescriptor_t * const pxStartDescriptor = *ppxStartDescriptor;

            *ppxStartDescriptor = NULL;
            *ppxEndDescriptor = NULL;
            prvReleaseNetworkBufferDescriptor( pxStartDescriptor );
        }

        xDropCurrentRxFrame = pdTRUE;
        return;
    }

    NetworkBufferDescriptor_t * const pxCurDescriptor = pxPacketBuffer_to_NetworkBuffer( ( const void * ) pucBuff );

    if( pxCurDescriptor == NULL )
    {
        FreeRTOS_debug_printf( ( "HAL_ETH_RxLinkCallback: Invalid buffer descriptor\n" ) );

        if( *ppxStartDescriptor != NULL )
        {
            NetworkBufferDescriptor_t * const pxStartDescriptor = *ppxStartDescriptor;

            *ppxStartDescriptor = NULL;
            *ppxEndDescriptor = NULL;
            prvReleaseNetworkBufferDescriptor( pxStartDescriptor );
        }

        xDropCurrentRxFrame = pdTRUE;
        return;
    }

    if( ( usLength == 0U ) || ( usLength > niEMAC_DATA_BUFFER_SIZE ) ||
        ( usLength > pxCurDescriptor->xDataLength ) )
    {
        FreeRTOS_debug_printf( ( "HAL_ETH_RxLinkCallback: Invalid buffer length\n" ) );

        if( *ppxStartDescriptor != NULL )
        {
            NetworkBufferDescriptor_t * const pxStartDescriptor = *ppxStartDescriptor;

            *ppxStartDescriptor = NULL;
            *ppxEndDescriptor = NULL;
            prvReleaseNetworkBufferDescriptor( pxStartDescriptor );
        }

        prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
        xDropCurrentRxFrame = pdTRUE;
        return;
    }

    #ifdef niEMAC_CACHEABLE
        if( niEMAC_CACHE_MAINTENANCE != 0 )
        {
            /* Invalidate DMA-written data before the packet is read by the CPU. */
            prvCacheInvalidateByAddr( pucBuff, usLength );
        }
    #endif

    if( xDropCurrentRxFrame != pdFALSE )
    {
        if( *ppxStartDescriptor != NULL )
        {
            NetworkBufferDescriptor_t * const pxStartDescriptor = *ppxStartDescriptor;

            *ppxStartDescriptor = NULL;
            *ppxEndDescriptor = NULL;
            prvReleaseNetworkBufferDescriptor( pxStartDescriptor );
        }

        prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
        return;
    }

    if( *ppxStartDescriptor != NULL )
    {
        NetworkBufferDescriptor_t * const pxStartDescriptor = *ppxStartDescriptor;

        FreeRTOS_debug_printf( ( "HAL_ETH_RxLinkCallback: Multi-buffer packets are unsupported\n" ) );
        *ppxStartDescriptor = NULL;
        *ppxEndDescriptor = NULL;
        xDropCurrentRxFrame = pdTRUE;
        prvReleaseNetworkBufferDescriptor( pxStartDescriptor );
        prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
        return;
    }

    pxCurDescriptor->xDataLength = usLength;
    #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
        pxCurDescriptor->pxNextBuffer = NULL;
    #endif
    *ppxStartDescriptor = pxCurDescriptor;
    *ppxEndDescriptor = pxCurDescriptor;
}

/*---------------------------------------------------------------------------*/

void HAL_ETH_TxFreeCallback( uint32_t * pulBuff )
{
    if( pulBuff != NULL )
    {
        NetworkBufferDescriptor_t * const pxNetworkBuffer = ( NetworkBufferDescriptor_t * ) pulBuff;

        prvReleaseNetworkBufferDescriptor( pxNetworkBuffer );
    }
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                           Buffer Allocation                               */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

size_t uxNetworkInterfaceAllocateRAMToBuffers( NetworkBufferDescriptor_t pxNetworkBuffers[ ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS ] )
{
    static uint8_t ucNetworkPackets[ ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS ][ niEMAC_TOTAL_BUFFER_SIZE ] __ALIGNED( niEMAC_BUF_ALIGNMENT ) __attribute__( ( section( niEMAC_BUFFERS_SECTION ) ) );

    configASSERT( niEMAC_TOTAL_BUFFER_SIZE >= ipconfigETHERNET_MINIMUM_PACKET_BYTES );
    configASSERT( xBufferAllocFixedSize == pdTRUE );

    size_t uxIndex;

    for( uxIndex = 0; uxIndex < ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS; ++uxIndex )
    {
        pxNetworkBuffers[ uxIndex ].pucEthernetBuffer = &( ucNetworkPackets[ uxIndex ][ ipBUFFER_PADDING ] );
        *( ( uint32_t * ) &( ucNetworkPackets[ uxIndex ][ 0 ] ) ) = ( uint32_t ) ( &( pxNetworkBuffers[ uxIndex ] ) );
    }

    return( niEMAC_TOTAL_BUFFER_SIZE - ipBUFFER_PADDING );
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                      Network Interface Definition                         */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

NetworkInterface_t * pxSTM32_FillInterfaceDescriptor( BaseType_t xEMACIndex,
                                                      NetworkInterface_t * pxInterface )
{
    static char pcName[ 17 ];

    ( void ) snprintf( pcName, sizeof( pcName ), "eth%u", ( unsigned ) xEMACIndex );

    ( void ) memset( pxInterface, '\0', sizeof( *pxInterface ) );
    pxInterface->pcName = pcName;
    /* TODO: use pvArgument to get xEMACData? */
    /* xEMACData.xEMACIndex = xEMACIndex; */
    /* pxInterface->pvArgument = ( void * ) &xEMACData; */
    /* pxInterface->pvArgument = pvPortMalloc( sizeof( EMACData_t ) ); */
    pxInterface->pvArgument = ( void * ) xEMACIndex;
    pxInterface->pfInitialise = prvNetworkInterfaceInitialise;
    pxInterface->pfOutput = prvNetworkInterfaceOutput;
    pxInterface->pfGetPhyLinkStatus = prvGetPhyLinkStatus;

    pxInterface->pfAddAllowedMAC = prvAddAllowedMACAddress;
    pxInterface->pfRemoveAllowedMAC = prvRemoveAllowedMACAddress;

    return FreeRTOS_AddNetworkInterface( pxInterface );
}

